apache/nuttx/arch/arm/src/stm32/hardware/stm32g47xxx_uart.h
/* Control Register 3 */

#define USART_CR3_EIE                  (1 << 0)                           /* Error Interrupt Enable */
#define USART_CR3_IREN                 (1 << 1)                           /* IrDA Mode Enable */
#define USART_CR3_IRLP                 (1 << 2)                           /* IrDA Low-Power */
#define USART_CR3_HDSEL                (1 << 3)                           /* Half-Duplex Selection */
#define USART_CR3_NACK                 (1 << 4)                           /* SmartCard NACK Enable */
#define USART_CR3_SCEN                 (1 << 5)                           /* SmartCard Mode Enable */
#define USART_CR3_DMAR                 (1 << 6)                           /* DMA Enable Receiver */
#define USART_CR3_DMAT                 (1 << 7)                           /* DMA Enable Transmitter */
#define USART_CR3_RTSE                 (1 << 8)                           /* RTS Enable */
#define USART_CR3_CTSE                 (1 << 9)                           /* CTS Enable */
#define USART_CR3_CTSIE                (1 << 10)                          /* CTS Interrupt Enable */
#define USART_CR3_ONEBIT               (1 << 11)                          /* One Sample Bit Method Enable */
#define USART_CR3_OVRDIS               (1 << 12)                          /* Overrun Disable */
#define USART_CR3_DDRE                 (1 << 13)                          /* DMA Disable on Reception Error */
#define USART_CR3_DEM                  (1 << 14)                          /* Driver Enable Mode */
#define USART_CR3_DEP                  (1 << 15)
#define USART_CR3_SCARCNT_SHIFT        (17)                               /* SmartCard Auto-Retry Count */
#define USART_CR3_SCARCNT_MASK         (0x7 << USART_CR3_SCARCNT_SHIFT)
#  define USART_CR3_SCARCNT(n)         (((n) << USART_CR3_SCARCNT_SHIFT) & USART_CR3_SCARCNT_MASK)
#define USART_CR3_WUS_SHIFT            (20)                               /* Wake Up From Low Power Mode Interrupt Flag Selection) */
#define USART_CR3_WUS_MASK             (0x3 << USART_CR3_WUS_SHIFT)
#  define USART_CR3_WUS_ADDR           (0x0 << USART_CR3_WUS_SHIFT)       /* On Address Match */
#  define USART_CR3_WUS_STARTBIT       (0x2 << USART_CR3_WUS_SHIFT)       /* On Start Bit Detection */
#  define USART_CR3_WUS_RXFNE          (0x3 << USART_CR3_WUS_SHIFT)       /* On RXNE/RXFNE */
#define USART_CR3_WUFIE                (1 << 22)                          /* Wake Up From Low Power Mode Interrupt Enable */
#define USART_CR3_TXFTIE               (1 << 23)                          /* Transmit FIFO Threshold Interrupt Enable */
#define USART_CR3_TCBGTIE              (1 << 24)                          /* Transmit Complete Before Guard Time Interrupt Enable */
#define USART_CR3_RXFTCFG_SHIFT        (25)                               /* Receive FIFO Threshold Configuration */
#define USART_CR3_RXFTCFG_MASK         (0x7 << USART_CR3_RXFTCFG_SHIFT)
#  define USART_CR3_RXFTCFG_1_8        (0x0 << USART_CR3_RXFTCFG_SHIFT)   /* When Rx FIFO Reaches 1/8Th Depth */
#  define USART_CR3_RXFTCFG_1_4        (0x1 << USART_CR3_RXFTCFG_SHIFT)   /* When Rx FIFO Reaches 1/4Th Depth */
#  define USART_CR3_RXFTCFG_1_2        (0x2 << USART_CR3_RXFTCFG_SHIFT)   /* When Rx FIFO Reaches 1/2 Depth */
#  define USART_CR3_RXFTCFG_3_4        (0x3 << USART_CR3_RXFTCFG_SHIFT)   /* When Rx FIFO Reaches 3/4Ths Depth */
#  define USART_CR3_RXFTCFG_7_8        (0x4 << USART_CR3_RXFTCFG_SHIFT)   /* When Rx FIFO Reaches 7/8Ths Depth */
#  define USART_CR3_RXFTCFG_FULL       (0x5 << USART_CR3_RXFTCFG_SHIFT)   /* When Rx FIFO Is Full */
#define USART_CR3_RXFTIE               (1 << 28)                          /* Receive FIFO Threshold Interrupt Enable */
#define USART_CR3_TXFTCFG_SHIFT        (29)                               /* Transmit FIFO Threshold Configuration */
#define USART_CR3_TXFTCFG_MASK         (0x7 << USART_CR3_TXFTCFG_SHIFT)
#  define USART_CR3_TXFTCFG_1_8        (0x0 << USART_CR3_TXFTCFG_SHIFT)   /* When Tx FIFO Reaches 1/8Th Depth */
#  define USART_CR3_TXFTCFG_1_4        (0x1 << USART_CR3_TXFTCFG_SHIFT)   /* When Tx FIFO Reaches 1/4Th Depth */
#  define USART_CR3_TXFTCFG_1_2        (0x2 << USART_CR3_TXFTCFG_SHIFT)   /* When Tx FIFO Reaches 1/2 Depth */
#  define USART_CR3_TXFTCFG_3_4        (0x3 << USART_CR3_TXFTCFG_SHIFT)   /* When Tx FIFO Reaches 3/4Ths Depth */
#  define USART_CR3_TXFTCFG_7_8        (0x4 << USART_CR3_TXFTCFG_SHIFT)   /* When Tx FIFO Reaches 7/8Ths Depth */
#  define USART_CR3_TXFTCFG_FULL       (0x5 << USART_CR3_TXFTCFG_SHIFT)   /* When Tx FIFO Is Full */

/* BAUD Rate Register */

/* Full BRR field */

#define USART_BRR_SHIFT                (0)
#define USART_BRR_MASK                 (0xffff << USART_BRR_BRR_SHIFT)
#  define USART_BRR(n)                 (((n) << USART_BRR_BRR_SHIFT) & USART_BRR_BRR_MASK)

/* Partial BRR field BRR[3:0]:
 *
 * When OVER8 = 0: BRR[3:0] = USARTDIV[3:0]
 *
 * When OVER8 = 1: BRR[2:0] = (USARTDIV[3:0] >> 1) and
 *                 BRR[3] must be kept cleared.
 */

#define USART_BRR_0_3_SHIFT            (0)
#define USART_BRR_0_3_MASK             (0xf << USART_BRR_0_3_SHIFT)
#  define USART_BRR_0_3(n)             (((n) << USART_BRR_0_3_SHIFT) & USART_BRR_0_3_MASK)

/* Partial BRR field BRR[15:4]:
 * BRR[15:4] = USARTDIV[15:4]
 */

#define USART_BRR_4_15_SHIFT           (4)
#define USART_BRR_4_15_MASK            (0xfff << USART_BRR_4_15_SHIFT)
#  define USART_BRR_4_15(n)            (((n) << USART_BRR_4_15_SHIFT) & USART_BRR_4_15_MASK)

/* Guard Time and Prescaler Register */

#define USART_GTPR_PSC_SHIFT           (0)            /* Prescaler Value */
#define USART_GTPR_PSC_MASK            (0xff << USART_GTPR_PSC_SHIFT)
#  define USART_GTPR_PSC(n)            (((n) << USART_GTPR_PSC_SHIFT) & USART_GTPR_PSC_MASK)
#define USART_GTPR_GT_SHIFT            (8)            /* Guard Time Value */
#define USART_GTPR_GT_MASK             (0xff << USART_GTPR_GT_SHIFT)
#  define USART_GTPR_GT(n)             (((n) << USART_GTPR_GT_SHIFT) & USART_GTPR_GT_MASK)

/* Receiver Timeout Register */

#define USART_RTOR_RTO_SHIFT           (0)           /* Receiver Time Out Value */
#define USART_RTOR_RTO_MASK            (0xffffff << USART_RTOR_RTO_SHIFT)
#  define USART_RTOR_RTO(n)            (((n) << USART_RTOR_RTO_SHIFT) & USART_RTOR_RTO_MASK)
#define USART_RTOR_BLEN_SHIFT          (24)          /* Block Length */
#define USART_RTOR_BLEN_MASK           (0xff << USART_RTOR_BLEN_SHIFT)
#  define USART_RTOR_BLEN(n)           (((n) << USART_RTOR_BLEN_SHIFT) & USART_RTOR_BLEN_MASK)

/* Request Register */

