apache/nuttx/arch/arm/src/stm32/hardware/stm32g47xxx_uart.h
#define USART_RQR_ABRRQ                (1 << 0)       /* Bit 0 - Auto-Baud Rate Request */
#define USART_RQR_SBKRQ                (1 << 1)       /* Bit 1 - Send Break Request */
#define USART_RQR_MMRQ                 (1 << 2)       /* Bit 2 - Mute Mode Request */
#define USART_RQR_RXFRQ                (1 << 3)       /* Bit 3 - Receive Data Flush Request */
#define USART_RQR_TXFRQ                (1 << 4)       /* Bit 4 - Transmit Data Flush Request */

/* Interrupt and Status Register */

#define USART_ISR_PE                   (1 << 0)       /* Bit 0 - Parity Error */
#define USART_ISR_FE                   (1 << 1)       /* Bit 1 - Framing Error */
#define USART_ISR_NE                   (1 << 2)       /* Bit 2 - Noise Detected Flag */
#define USART_ISR_ORE                  (1 << 3)       /* Bit 3 - Overrun Error */
#define USART_ISR_IDLE                 (1 << 4)       /* Bit 4 - Idle Line Detected */
#define USART_ISR_RXFNE                (1 << 5)       /* Bit 5 (When FIFO in use) - Rx FIFO Not Empty */
#define USART_ISR_RXNE                 (1 << 5)       /* Bit 5 (When FIFO not in use) - Rx Data Register Not Empty */
#define USART_ISR_TC                   (1 << 6)       /* Bit 6 - Transmission Complete */
#define USART_ISR_TXFNF                (1 << 7)       /* Bit 7 (When FIFO in use) - Tx FIFO Not Full */
#define USART_ISR_TXE                  (1 << 7)       /* Bit 7 (When FIFO not in use) - Tx Data Register Empty */
#define USART_ISR_LBDF                 (1 << 8)       /* Bit 8 - LIN Break Detection Flag */
#define USART_ISR_CTSIF                (1 << 9)       /* Bit 9 - CTS Interrupt Flag */
#define USART_ISR_CTS                  (1 << 10)      /* Bit 10 - CTS Flag */
#define USART_ISR_RTOF                 (1 << 11)      /* Bit 11 - Receiver Time Out */
#define USART_ISR_EOBF                 (1 << 12)      /* Bit 12 - End of Block Flag */
#define USART_ISR_UDR                  (1 << 13)      /* Bit 13 - SPI Slave Underrun Error Flag */
#define USART_ISR_ABRE                 (1 << 14)      /* Bit 14 - Auto BAUD Rate Error */
#define USART_ISR_ABRF                 (1 << 15)      /* Bit 15 - Auto BAUD Rate Flag */
#define USART_ISR_BUSY                 (1 << 16)      /* Bit 16 - Busy Flag */
#define USART_ISR_CMF                  (1 << 17)      /* Bit 17 - Character Match Flag */
#define USART_ISR_SBKF                 (1 << 18)      /* Bit 18 - Send Break Flag */
#define USART_ISR_RWU                  (1 << 19)      /* Bit 19 - Receive Wake Up From Mute Mode Flag */
#define USART_ISR_WUF                  (1 << 20)      /* Bit 20 - Wake Up From Stop Mode Flag */
#define USART_ISR_TEACK                (1 << 21)      /* Bit 21 - Transmit Enable Acknowledge Flag */
#define USART_ISR_REACK                (1 << 22)      /* Bit 22 - Receive Enable Acknowledge Flag */
#define USART_ISR_TXFE                 (1 << 23)      /* Bit 23 (When FIFO in use) - Tx FIFO Empty */
#define USART_ISR_RXFF                 (1 << 24)      /* Bit 24 (When FIFO in use) - Rx FIFO Full */
#define USART_ISR_TCBGT                (1 << 25)      /* Bit 25 - Transmission Complete Before Guard Time Completion */
#define USART_ISR_RXFT                 (1 << 26)      /* Bit 26 (When FIFO in use) - Rx FIFO Threshold Flag */
#define USART_ISR_TXFT                 (1 << 27)      /* Bit 27 (When FIFO in use) - Tx FIFO Threshold Flag */

#define USART_ISR_ALLBITS              (0x0fffffff)

/* Interrupt Flag Clear Register */

#define USART_ICR_PECF                 (1 << 0)       /* Bit 0 - Parity Error Clear Flag */
#define USART_ICR_FECF                 (1 << 1)       /* Bit 1 - Framing Error Clear Flag */
#define USART_ICR_NCF                  (1 << 2)       /* Bit 2 - Noise detected Clear Flag */
#define USART_ICR_ORECF                (1 << 3)       /* Bit 3 - OverRun Error Clear Flag */
#define USART_ICR_IDLECF               (1 << 4)       /* Bit 4 - Idle Line Detected Clear Flag */
#define USART_ICR_TXFECF               (1 << 5)       /* Bit 5 - Tx FIFO Empty Clear Flag */
#define USART_ICR_TCCF                 (1 << 6)       /* Bit 6 - Transmission Complete Clear Flag */
#define USART_ICR_TCBGTCF              (1 << 7)       /* Bit 7 - Transmission Complete Before Guard Time Clear Flag */
#define USART_ICR_LBDCF                (1 << 8)       /* Bit 8 - LIN Break Detection Clear Flag */
#define USART_ICR_CTSCF                (1 << 9)       /* Bit 9 - CTS Interrupt Clear Flag */
#define USART_ICR_RTOCF                (1 << 11)      /* Bit 11 - Receiver Timeout Clear Flag */
#define USART_ICR_EOBCF                (1 << 12)      /* Bit 12 - End of Block Clear Flag */
#define USART_ICR_UDRCF                (1 << 13)      /* Bit 13 - SPI Slave Underrun Clear Flag */
#define USART_ICR_CMCF                 (1 << 17)      /* Bit 17 - Character Match Clear Flag */
#define USART_ICR_WUCF                 (1 << 20)      /* Bit 20 - Wake Up From Stop Mode Clear Flag */

/* Receive Data Register */

#define USART_RDR_SHIFT                (0)
#define USART_RDR_MASK                 (0x1ff << USART_RDR_SHIFT)
#  define USART_RDR(n)                 (((n) << USART_RDR_SHIFT) & USART_RDR_MASK)

/* Transmit Data Register */

#define USART_TDR_SHIFT                (0)
#define USART_TDR_MASK                 (0x1ff << USART_TDR_SHIFT)
#  define USART_TDR(n)                 (((n) << USART_TDR_SHIFT) & USART_TDR_MASK)

/* Prescaler Register */

#define USART_PRESC_PRESCALER_SHIFT    (0)
#define USART_PRESC_PRESCALER_MASK     (0xf << USART_PRESC_PRESCALER_SHIFT)
#define USART_PRESC_PRESCALER_1        (0x0 << USART_PRESC_PRESCALER_SHIFT)
#define USART_PRESC_PRESCALER_2        (0x1 << USART_PRESC_PRESCALER_SHIFT)
#define USART_PRESC_PRESCALER_4        (0x2 << USART_PRESC_PRESCALER_SHIFT)
#define USART_PRESC_PRESCALER_6        (0x3 << USART_PRESC_PRESCALER_SHIFT)
#define USART_PRESC_PRESCALER_8        (0x4 << USART_PRESC_PRESCALER_SHIFT)
#define USART_PRESC_PRESCALER_10       (0x5 << USART_PRESC_PRESCALER_SHIFT)
#define USART_PRESC_PRESCALER_12       (0x6 << USART_PRESC_PRESCALER_SHIFT)
#define USART_PRESC_PRESCALER_16       (0x7 << USART_PRESC_PRESCALER_SHIFT)
#define USART_PRESC_PRESCALER_32       (0x8 << USART_PRESC_PRESCALER_SHIFT)
#define USART_PRESC_PRESCALER_64       (0x9 << USART_PRESC_PRESCALER_SHIFT)
#define USART_PRESC_PRESCALER_128      (0xa << USART_PRESC_PRESCALER_SHIFT)
#define USART_PRESC_PRESCALER_256      (0xb << USART_PRESC_PRESCALER_SHIFT)

/* Compatibility definitions ************************************************/

/* Compatibility with F1/F2/F4 Status Register names */

#define STM32_USART_SR_OFFSET          STM32_USART_ISR_OFFSET

