apache/nuttx/arch/arm/src/stm32/hardware/stm32g47xxx_uart.h
#define USART_SR_PE                    USART_ISR_PE   /* Parity Error */
#define USART_SR_FE                    USART_ISR_FE   /* Framing error */
#define USART_SR_NE                    USART_ISR_NE   /* Noise detected flag */
#define USART_SR_ORE                   USART_ISR_ORE  /* Overrun error */
#define USART_SR_IDLE                  USART_ISR_IDLE /* IDLE line detected */
#define USART_SR_RXNE                  USART_ISR_RXNE /* Read Data Register Not Empty */
#define USART_SR_TC                    USART_ISR_TC   /* Transmission Complete */
#define USART_SR_TXE                   USART_ISR_TXE  /* Transmit Data Register Empty */
#define USART_SR_LBD                   USART_ISR_LBDF /* LIN Break Detection Flag */
#define USART_SR_CTS                   USART_ISR_CTS  /* CTS Flag */

#define USART_SR_ALLBITS               USART_ISR_ALLBITS

#define USART_CR1_M                    USART_CR1_M0

/****************************************************************************
 * Public Types
 ****************************************************************************/

/****************************************************************************
 * Public Data
 ****************************************************************************/

/****************************************************************************
 * Public Function Prototypes
 ****************************************************************************/

#endif /* __ARCH_ARM_SRC_STM32_HARDWARE_STM32G47XXX_UART_H */
